{"documentID":"document_1","authorSetIDs":["author_1"],"fullText":"So, imagine living in Westeros, where winter is always coming, dragons are flying around, and every noble family has its own agenda. The Starks are all about honor and duty, but their loyalty often lands them in hot water. Meanwhile, the Lannisters are scheming and always seem to be a few steps ahead, thanks to their motto, \"A Lannister always pays his debts.\" Then there's Daenerys with her three dragons, trying to break chains and reclaim the Iron Throne. The political intrigue, backstabbing, and epic battles keep you on the edge of your seat, making it one heck of a wild ride through the Seven Kingdoms.","languages":["en"],"lengthWords":106}
{"documentID":"document_2","authorSetIDs":["author_2"],"fullText":"In classical mechanics, Newton's second law of motion is a fundamental principle that describes the relationship between the force applied to an object and its resulting acceleration. This law is succinctly expressed by the equation:\n\n\\[ F = ma \\]\n\nwhere \\( F \\) represents the force applied to the object, \\( m \\) denotes the mass of the object, and \\( a \\) is the acceleration produced.\n\nTo elaborate, force (\\( F \\)) is a vector quantity that causes an object to change its velocity, hence producing acceleration (\\( a \\)). The mass (\\( m \\)) is a scalar quantity that quantifies the amount of matter in the object. According to Newton's second law, the acceleration of an object is directly proportional to the net force acting on it and inversely proportional to its mass. Thus, if the same force is applied to two objects of different masses, the object with the smaller mass will experience a greater acceleration.\n\nConsider an example where a force of 10 Newtons is applied to a mass of 2 kilograms. Using Newton's second law, the acceleration can be calculated as follows:\n\n\\[ a = \\frac{F}{m} = \\frac{10 \\, \\text{N}}{2 \\, \\text{kg}} = 5 \\, \\text{m/s}^2 \\]\n\nThis result indicates that the object will accelerate at a rate of \\( 5 \\, \\text{m/s}^2 \\) under the influence of the given force. Newton's second law is crucial in understanding and predicting the motion of objects under various forces, forming the cornerstone of classical mechanics.","languages":["en"],"lengthWords":249}
{"documentID":"document_3","authorSetIDs":["author_1"],"fullText":"The Big Bang Theory is this hilarious show about a bunch of super-smart but socially awkward scientists. You've got Sheldon, who's a genius but has zero social skills, and his roommate Leonard, who's also really smart but a bit more normal. They hang out with their friends Raj and Howard, and they all have these funny, geeky adventures. Then there's Penny, their neighbor, who's not a scientist but adds a lot of humor and heart to the mix. The show is packed with nerdy jokes, comic book references, and a lot of awkward but endearing moments. It's a blast watching these characters navigate friendships, relationships, and their careers while staying true to their geeky roots.","languages":["en"],"lengthWords":115}
{"documentID":"document_4","authorSetIDs":["author_3"],"fullText":"Lo, the croissant, a marvel of the baker's art, doth grace our tables with its golden hue and delicate layers. Born of France's fertile land, 'tis a crescent-shaped delight, its buttery essence whispering tales of yore. Each bite reveals a symphony of flakiness, as if the very muses had bestowed their blessings upon it. Verily, 'tis not mere sustenance, but a celestial indulgence that doth elevate the spirit. As the morning sun doth rise, so too doth the croissant awaken our senses, a testament to the artistry and passion of those who craft such sublime confections.","languages":["en"],"lengthWords":96}
{"documentID":"document_5","authorSetIDs":["author_4"],"fullText":"Computers are nothing short of magical! These incredible machines open up entire worlds of possibilities, connecting us with loved ones across the globe and empowering us to explore the farthest reaches of our imagination. Every click, every keystroke feels like a dance of pure potential. From creating beautiful art to solving complex problems, computers are the heartbeats of our modern lives. They hold our memories, our dreams, and our ambitions, all wrapped up in sleek, shiny cases. The joy of discovering something new, the thrill of a perfectly executed code, the comfort of a late-night movie marathon—computers are our trusted companions in this journey through the digital age.","languages":["en"],"lengthWords":108}